package com.desksoft.wechat.common.model.otherbean;

public enum ScoketCode {
	
	c00("操作成功"), c11("该客户号没有欠费"), c12("欠费笔数超过额度"), c13("水费记录已锁定")
	, c21("部分水费已销帐"), c22("金额不符"), c24("进帐流水号重复")
	, c31("水费未销帐"), c32("该用户销帐日期小于今天"), c33("未知的进帐流水号"), c34("冲正金额不符")
	, c35("该用户已开发票，不能冲正"), c36("该用户已冲正")
	, c41("对帐有误差，请检查对帐错误文件"), c42("对帐文件结果行与内容不符"), c43("文件不存在"), c44("文件长度不对")
	, c45("清算日不正确"), c46("文件内清算日不正确"), c51("该客户号无开票信息"), c61("无水费信息")
	, c62("水费未销帐，不能补开"), c63("发票已打印"), c64("发票代码错误"), c65("发票代码错误")
	, c66("该发票号已使用"), c67("非本行开票"), c68("发票号有重复"), c69("该发票号不存在或未开票")
	, c6A("该发票号已作废")
	, c71("以前的扣款尚未处理"), c72("清算日不符"), c73("返回金额与送盘金额不符"), c74("总金额或总笔数不符")
	, c75("总笔数不符"), c76("总金额不符"), c77("返回笔数与送盘笔数不符"), c78("返回金额与送盘金额不符")
	, c79("扣款笔数不符"), c7A("扣款金额不符"), c7B("文件长度不符")
	, c81("用户有欠费"), c82("用户状态不正常(可能是销户,报停,欠费停水,等)"), c83("用户已作委托"), c84("开户行不存在")
	, c85("用户已和其他账号对应")
	, c90("该客户号不存在"), c91("包错误"), c98("其他原因"), c99("系统故障");
    
    private final String value;

    //构造器默认也只能是private, 从而保证构造函数只能在内部使用
    ScoketCode(String value) {
        this.value = value;
    }
    
    public String getValue() {
        return value;
    }
}
